{
  "core.image.OpenCvImageProcessor": {
    "processImages(Path, int[], AbilityConfig)": "The main public method that orchestrates the pre-processing of all ability icons. It lists all image files in the root `abilitiesRoot` directory, and for each one, it calls `processSingleImage`. This is a crucial, one-time setup step performed on application startup. Its purpose is to generate pre-scaled and masked versions of all ability icons for every required size, which are then saved to disk in subfolders. This pre-processing is a major performance optimization. It is called by `ConfigManager`.",
    "processSingleImage(Path, MaskSelection, Path, int[])": "A private worker method that handles the transformation of a single ability icon. For a given source image, it iterates through a list of target sizes (e.g., 30px, 45px). In each iteration, it resizes the image to the target dimensions, applies a circular alpha mask using the `applyMask` method, and saves the final PNG image to the corresponding subfolder (e.g., `/Abilities/30`). It manages the lifecycle of native OpenCV `Mat` objects to prevent memory leaks.",
    "selectMaskForAbility(Path, Path, AbilityConfig)": "A private helper method that determines which alpha mask to use for a given ability icon. It reads the ability's configuration from `AbilityConfig`. If a specific `mask` is defined (e.g., 'mask_potion'), it resolves the path to that mask file. If not, it defaults to the standard circular 'mask.png'. This allows certain icons, like potions, to retain their rectangular shape while others are made circular, improving visual representation in the UI. It returns a `MaskSelection` object containing the chosen path and aspect ratio settings.",
    "applyMask(Mat, Mat)": "A private utility method that applies an alpha mask to a source image using OpenCV operations. It takes a source image and a mask image (typically grayscale), converts the mask into an alpha channel, and merges it with the BGR channels of the source image to create a final BGRA image with transparency. This is the core logic for creating the circular icons used throughout the application. It is called by `processSingleImage` and carefully manages native `Mat` resources."
  },
  "core.image.ImageProcessor": {
    "processImages(Path, int[], AbilityConfig)": "This is the single method of the `ImageProcessor` interface, defining the contract for image pre-processing. It specifies that an implementation must be able to take a root directory of ability icons, an array of target sizes, and the `AbilityConfig`, and process them. This abstraction decouples the `ConfigManager` from the concrete `OpenCvImageProcessor` implementation. It is implemented by `OpenCvImageProcessor` and called by `ConfigManager` during initial setup."
  }
}