{
  "infrastructure.capture.ScreenCapture": {
    "ScreenCapture(AppSettings)": "Constructor for the `ScreenCapture` class. It detects the host operating system, determines the full screen bounds, and initializes an OpenCV frame converter. Crucially, it establishes the initial capture region by reading from `AppSettings` or defaulting to full screen. This setup is vital for configuring the FFmpeg grabber correctly for the user's environment. This is called by `Main` at startup. It does not initialize the native grabber, which is deferred for performance.",
    "initializeGrabber()": "A private, synchronized method that performs the complex, one-time setup of the underlying `FFmpegFrameGrabber`. It configures platform-specific input formats ('gdigrab' for Windows), sets performance options (low latency, high framerate), and attempts to enable hardware acceleration. It then configures the capture region, either natively if supported or for in-memory cropping. This heavy operation is intentionally deferred until the first call to `captureScreen()`. Failure here is critical and will prevent screen capture.",
    "captureScreen()": "This is the primary public method, called repeatedly by the `DetectionEngine`. On its first invocation, it triggers the deferred `initializeGrabber()` method. In subsequent calls, it grabs the next available frame from the FFmpeg stream, converts it to an OpenCV `Mat` object, and if necessary, crops the full-screen image down to the user-defined `captureRegion`. It returns a clone of the final `Mat`, ensuring the original can be released to prevent memory leaks. Thread-safety is managed internally.",
    "setRegion(Rectangle)": "A synchronized public method that allows the capture region to be changed at runtime, for instance by the `RegionSelectorWindow`. It clamps the new region to the screen bounds to prevent errors. If the platform supports native region capture (like Windows), and the region has actually changed, it will trigger a full restart of the FFmpeg grabber to apply the new dimensions at the hardware level. This can be a slow operation.",
    "shutdown()": "A critical resource cleanup method. It ensures that the native `FFmpegFrameGrabber` is properly stopped and closed, and that the OpenCV converter's resources are also released. This is called by the shutdown hook in `Main` to prevent the application from leaving defunct processes or causing memory leaks in the native graphics libraries.",
    "configureCaptureRegion()": "A private helper that applies the `captureRegion` to the `FFmpegFrameGrabber`. For platforms that support it (Windows, Linux), it sets FFmpeg options to capture only the specified rectangle, which is highly efficient. For other platforms (macOS), or for full-screen capture, it configures the grabber to take a full-screen image, which will then be cropped in memory by the `captureScreen` method. This logic is key to both performance and cross-platform compatibility."
  }
}