{
  "ui.presetManager.detail.SequenceDetailService": {
    "createAbilityItem(String)": "A factory method that converts a raw ability key (a string) into a rich `AbilityItem` object. It fetches the ability's metadata (like display name, level) from the `AbilityConfig` and loads its icon using the `AbilityIconLoader`. This service acts as a bridge between the raw configuration data and the UI-specific models needed for rendering.",
    "saveSequence(...)": "This method handles the business logic for saving a sequence. It takes the sequence's name and its expression string, resolves its unique ID, and then updates the `RotationConfig` object. Finally, it calls `configManager.saveRotations()` to persist the changes to disk. It returns a `SaveOutcome` object, which indicates success or failure and provides appropriate user-facing messages. This is called by the `SequenceDetailPresenter`."
  },
  "ui.presetManager.detail.SequenceDetailPresenter": {
    "SequenceDetailPresenter(...)": "Constructor for the Presenter in a Model-View-Presenter (MVP) architecture. It takes the `SequenceDetailService` (Model), the `AbilityFlowView` (View), and the `SequenceDetailPanel` (also a View). It initializes the `ExpressionBuilder` and wires itself up as the `DragCallback` for the `AbilityFlowView`'s `AbilityDragController`. This class contains all the presentation logic, decoupling the UI components from the business logic.",
    "loadSequence(...)": "This method is called by the `PresetManagerWindow` when a sequence is selected. It takes the `PresetData`, parses its expression string into a list of `SequenceElement`s using the `detailService`, and then calls `flowView.renderSequenceElements` to display them. It also updates the sequence name in the view and caches the loaded state, allowing for a 'discard changes' feature.",
    "saveSequence()": "The action handler for the 'Save' button. It retrieves the current sequence name and the `currentElements` from the view, builds the expression string using `ExpressionBuilder`, and then calls `detailService.saveSequence` to persist the changes. It handles the `SaveOutcome` to show success or error messages to the user via the view's `showSaveDialog` method.",
    "onDragStart(...)": "Implementation of the `DragCallback`. When a drag begins on an existing ability card, this method is responsible for creating a 'preview' state by removing the dragged ability from the list of elements using the `ExpressionBuilder`. This allows the UI to show what the sequence will look like while the drag is in progress.",
    "onDragEnd(AbilityItem, boolean)": "Implementation of the `DragCallback` that finalizes a drag-and-drop operation. If `commit` is true, it uses the `ExpressionBuilder` to insert the dragged item into its new position. It distinguishes between standard ability items and `ClipboardInsertItem`s, calling `insertAbility` or `insertSequence` respectively. If the drag ended in the trash zone (outside the panel) after starting from the sequence, it commits the removal preview instead of cancelling. If `commit` is false and no trash drop occurred, it reverts the element list to its state before the drag began. Finally, it re-renders the `AbilityFlowView` with the updated state."
  },
  "ui.presetManager.detail.SequenceDetailPanel": {
    "SequenceDetailPanel(SequenceDetailService)": "Constructor for the main 'detail' view in the Preset Manager. It creates and arranges all the main UI components: the sequence name text field, the Save/Discard buttons, the new clipboard insert button, and the `AbilityFlowView` where the sequence is rendered. It instantiates the `SequenceDetailPresenter` which manages all the logic for this panel. It serves as the top-level container for the sequence editor.",
    "startPaletteDrag(AbilityItem, JPanel, Point)": "This method is a bridge that allows the `AbilityPalettePanel` to initiate a drag that is controlled by this panel's presenter. When an ability is dragged from the palette, this method is called, and it delegates the drag initiation to the `presenter`, which in turn sets up the `AbilityDragController` for the operation.",
    "showSaveDialog(String, int)": "An implementation of the `View` interface for the presenter. It provides a way for the presenter to show messages to the user. It uses the injected `ToastManager` to display non-blocking, transient notifications for success, warnings, or errors, providing a more modern user experience than modal `JOptionPane` dialogs."
  },
  "ui.presetManager.detail.ClipboardInsertItem": {
    "ClipboardInsertItem(String, String, ImageIcon, List<SequenceElement>, String)": "Constructor for a specialized `AbilityItem` that carries a parsed sequence rotation. It is used when dragging content from the clipboard insert button. Unlike a standard item which represents a single ability, this item holds a list of `SequenceElement`s and the original expression string.",
    "getElements()": "Returns the list of `SequenceElement` objects parsed from the clipboard content.",
    "getExpression()": "Returns the original raw string expression from the clipboard.",
    "isSingleAbility()": "Helper method to determine if the clipboard content consists of just a single ability (no separators). This allows the system to treat it like a standard ability drop if appropriate.",
    "isMultiStep()": "Helper method to determine if the clipboard content contains multiple steps (arrows), indicating a full rotation sequence."
  },
  "ui.presetManager.detail.AbilityGroupPanel": {
    "AbilityGroupPanel(Color)": "Constructor for a simple `JPanel` that acts as a visual container for a group of abilities that are linked by '+' (AND) or '/' (OR) operators. It uses a `FlowLayout` and sets a distinct background color and border to visually distinguish the group from standalone abilities in the `AbilityFlowView`."
  },
  "ui.presetManager.detail.AbilityCardFactory": {
    "createAbilityCard(AbilityItem)": "A factory method that creates a `JPanel` representing a single, draggable ability card in the sequence editor. It sets up the layout with an icon and a name label. Crucially, it attaches the `MouseAdapter` from the `AbilityDragController` to the card, making it draggable. It also stores the ability's key and element index as client properties for later retrieval during drag operations.",
    "createSeparatorLabel(SequenceElement)": "A factory method that creates a `JLabel` for displaying a separator (→, +, /) between ability cards in the `AbilityFlowView`. It styles the label to be visually distinct from the ability names."
  },
  "ui.presetManager.detail.AbilityFlowView": {
    "renderSequenceElements(List<SequenceElement>)": "The main rendering method for the sequence. It clears the panel and then iterates through the list of `SequenceElement`s. It intelligently groups consecutive abilities linked by '+' or '/' into a colored `AbilityGroupPanel` for better visual organization, while rendering standalone abilities and '→' separators directly. This method is what translates the flat list of elements into the structured visual representation.",
    "attachDragController(DragCallback)": "A setup method that connects this view to the `AbilityDragController`. It creates the controller, passing itself as the container and the `SequenceDetailPresenter` as the callback. This is a critical step in enabling the drag-and-drop functionality for this component.",
    "highlightDropZone(DropPreview)": "This method provides real-time visual feedback during a drag-and-drop operation. Based on the `DropPreview`, it highlights the target ability card with a color corresponding to the `DropZoneType` (e.g., green for AND, blue for OR). This shows the user exactly which card they are about to interact with. It's called on every mouse move during a drag.",
    "createPaletteDragListener(AbilityItem, JPanel)": "Creates a `MouseAdapter` that initiates a drag operation for a given ability item and card. This method delegates to the `AbilityDragController` to create the listener, enabling the new clipboard insert button (and other palette items) to trigger the standard drag-and-drop workflow."
  }
}