{
  "ui.presetManager.drag.DropZoneIndicators": {
    "setGlassPane(JComponent)": "Initializes the indicators by attaching them to the root pane's glass pane. The glass pane is a layer that sits on top of all other components, which allows the indicators to be drawn with absolute positioning anywhere in the window, regardless of the underlying layout. This setup is crucial for providing visual feedback during a drag-and-drop operation.",
    "showIndicators(Component, String, String)": "Displays the '+' (AND) and '/' (OR) symbols above and below a target ability card. It converts the target card's local coordinates to the glass pane's coordinate system to position the indicator labels correctly. A null symbol will hide the corresponding indicator. This provides clear visual cues for what will happen if the user drops an ability in the top or bottom hot zones of another ability.",
    "showInsertionLineBetweenCards(Component, Component, DropZoneType, DropSide)": "Displays a vertical line to indicate the precise insertion point between two cards. It uses the `DropSide` to correctly position the line even when the sequence wraps to a new row, ensuring the indicator appears visually adjacent to the correct card. The line color is determined by the `DropZoneType`."
  },
  "ui.presetManager.drag.model.DropSide": {
    "DropSide()": "This enum defines two simple constants: `LEFT` and `RIGHT`. Its purpose is to indicate which side of a target ability card a drop occurred on. This information is used by the `AbilityDragController` in conjunction with the `DropZoneType` to determine the exact insertion point and behavior of a drag-and-drop operation."
  },
  "ui.presetManager.drag.model.DropZoneType": {
    "DropZoneType()": "This enum defines the logical type of a drop zone: `AND` (for creating a '+' group), `OR` (for creating a '/' group), `NEXT` (for creating a '→' step), or `NONE`. This is a core part of the drag-and-drop logic, determined by the `AbilityDragController` based on the cursor's vertical position relative to a target ability card. The `ExpressionBuilder` uses this type to correctly modify the sequence."
  },
  "ui.presetManager.drag.model.DropPreview": {
    "DropPreview(int, DropZoneType, int, DropSide)": "Constructor for an immutable data object that represents a potential drop operation. It encapsulates all the information needed to execute the drop: the `insertIndex` in the element list, the `DropZoneType` (AND, OR, NEXT), the index of the visual target card, and the `DropSide` (LEFT/RIGHT). This object is created on every mouse move during a drag by the `AbilityDragController` and passed to the `SequenceDetailPresenter` to show a real-time preview of the change."
  },
  "ui.presetManager.drag.handler.AbilityDragController": {
    "createCardDragListener(AbilityItem, JPanel, boolean)": "A factory method that creates and returns a `MouseAdapter` specifically for a draggable ability card. The listener's `mousePressed` event initiates the drag by calling `startDrag`, `mouseDragged` calls `handleDrag`, and `mouseReleased` calls `handleRelease`. This is the primary entry point for making an ability card in the UI draggable.",
    "startDrag(...)": "A private method that begins a drag operation. It creates a `DragState` object to hold the drag's context. Crucially, it creates a `floatingCard`—a visual copy of the card being dragged—and adds it to the application's glass pane. This allows the card to be moved freely around the screen without disrupting the layout of the underlying panel. It also initializes the `DropZoneIndicators` on the glass pane.",
    "handleDrag(MouseEvent)": "This method is called continuously as the mouse is moved during a drag. It updates the position of the `floatingCard` on the glass pane to follow the cursor. Its main responsibility is to call `calculateDropPreview` to determine the current drop target and zone, update the `DropZoneIndicators` to provide real-time visual feedback, and notify the `DragCallback` of the potential change so the UI can be updated in real-time.",
    "handleRelease(MouseEvent)": "Finalizes the drag operation when the mouse is released. It performs one last `calculateDropPreview` to get the final drop location. If the drop is valid (i.e., inside the panel and on a valid zone), it notifies the `DragCallback` to commit the change. It then performs cleanup by removing the `floatingCard` and hiding all indicators. This is the method that triggers the actual modification of the sequence.",
    "calculateDropPreview(Point)": "The most complex method in the class, responsible for the core drop-targeting logic. It takes the current cursor position, finds the nearest ability card, and determines the `DropZoneType` (AND, OR, NEXT) and `DropSide` (LEFT, RIGHT) based on the cursor's precise location relative to that card. It then calculates the exact index where the new ability should be inserted into the `SequenceElement` list. It returns all this information in a `DropPreview` object."
  },
  "ui.presetManager.drag.handler.DragState": {
    "DragState(...)": "Constructor for this immutable data object. It captures a snapshot of the state at the beginning of a drag operation, including the `AbilityItem` being dragged, a reference to the source `JPanel`, whether it came from the palette, its original index in the sequence, and an immutable copy of the `SequenceElement` list at the moment the drag started. This ensures that all drag calculations are based on a consistent state, even if the UI is being re-rendered in real-time."
  }
}