{
  "ui.presetManager.drag.DropZoneIndicators": {
    "setGlassPane(JComponent)": "Initializes the indicators by attaching them to the root pane's glass pane. The glass pane is a layer that sits on top of all other components, which allows the indicators to be drawn with absolute positioning anywhere in the window, regardless of the underlying layout. This setup is crucial for providing visual feedback during a drag-and-drop operation.",
    "showIndicators(Component, String, String)": "Displays the '+' (AND) and '/' (OR) symbols above and below a target ability card. It converts the target card's local coordinates to the glass pane's coordinate system to position the indicator labels correctly. A null symbol will hide the corresponding indicator. This provides clear visual cues for what will happen if the user drops an ability in the top or bottom hot zones of another ability.",
    "showInsertionLineBetweenCards(Component, Component, DropZoneType, DropSide)": "Displays a vertical line to indicate the precise insertion point between two cards. It uses the `DropSide` to correctly position the line even when the sequence wraps to a new row, ensuring the indicator appears visually adjacent to the correct card. The line color is determined by the `DropZoneType`."
  },
  "ui.presetManager.drag.model.DropSide": {
    "DropSide()": "This enum defines two simple constants: `LEFT` and `RIGHT`. Its purpose is to indicate which side of a target ability card a drop occurred on. This information is used by the `AbilityDragController` in conjunction with the `DropZoneType` to determine the exact insertion point and behavior of a drag-and-drop operation."
  },
  "ui.presetManager.drag.model.DropZoneType": {
    "DropZoneType()": "This enum defines the logical type of a drop zone: `AND` (for creating a '+' group), `OR` (for creating a '/' group), `NEXT` (for creating a '→' step), or `NONE`. This is a core part of the drag-and-drop logic, determined by the `AbilityDragController` based on the cursor's vertical position relative to a target ability card. The `ExpressionBuilder` uses this type to correctly modify the sequence."
  },
  "ui.presetManager.drag.model.DropPreview": {
    "DropPreview(int, DropZoneType, int, DropSide)": "Constructor for an immutable data object that represents a potential drop operation. It encapsulates all the information needed to execute the drop: the `insertIndex` in the element list, the `DropZoneType` (AND, OR, NEXT), the index of the visual target card, and the `DropSide` (LEFT/RIGHT). Instances are created by the `DropPreviewEngine` on each preview tick and are embedded in `DragPreviewModel`s, with `equals`/`hashCode` implemented so previews can be compared and deduplicated efficiently."
  },
  "ui.presetManager.drag.model.DragPreviewModel": {
    "DragPreviewModel(DropPreview, PreviewSide, boolean, boolean, Point)": "Value object capturing a UI-ready snapshot of the current drag preview. It wraps a `DropPreview`, the `PreviewSide` that describes which edge of the card the cursor is anchored to, booleans indicating whether the top and bottom group buttons should be shown, and the cursor position in flow-panel coordinates. It exposes helpers like `isValid()` so the presenter and view can cheaply decide whether to apply highlighting or hide indicators without re-running geometry."
  },
  "ui.presetManager.drag.model.PreviewSide": {
    "PreviewSide()": "Enum that describes which edge of a target card the preview is anchored to: LEFT, RIGHT, TOP, BOTTOM, or NONE. It is derived from the cursor position by `DropPreviewEngine` and drives whether the ability flow shows grouping buttons above/below the card or treats the drag as a lateral insert alongside the card."
  },
  "ui.presetManager.drag.handler.AbilityDragController": {
    "createCardDragListener(AbilityItem, JPanel, boolean)": "Factory method that builds a `MouseAdapter` for a single draggable ability card. On press it resolves the card index, logs the current card ordering, and delegates to `startDrag` with the originating button. On drag it forwards events to `handleDrag`, which updates the glass-pane overlay and marks the preview as dirty. On release it hands control to `handleRelease` to compute the final preview and notify the presenter. This is the main hook used by `AbilityFlowView`.",
    "startDrag(...)": "Initialises a new drag operation. It creates a `DragState` snapshot from the dragged item, source card, palette flag, starting index, and current element list, then asks `DragOverlay` to create a floating copy of the card on the window's glass pane. It wires the glass pane into `DropIndicatorController`, notifies the callback via `onDragStart`, builds a `GeometryCache` from the current layout, and kicks off the preview timer to begin periodic `DropPreviewEngine` calculations.",
    "handleDrag(MouseEvent)": "Processes ongoing mouse movement during a drag. It repositions the floating card on the glass pane, converts the event coordinates into flow-panel space, marks the preview as needing recomputation, and clears release-phase logging. The actual hit-testing and `DropPreview` calculation happens asynchronously in `runPreviewTick`, which then dispatches the resulting `DragPreviewModel` to the presenter and indicator controller.",
    "handleRelease(MouseEvent)": "Final step in the drag lifecycle. It validates that the release button matches the button that started the drag, computes a final `DragPreviewModel` for the release point using `DropPreviewEngine`, and logs the resulting drop parameters. It then decides whether the drop should be committed (only for valid previews inside the panel), calls `cleanup` to tear down overlays and timers, and invokes `onDragEnd` on the callback with the commit flag.",
    "runPreviewTick()": "Timer-driven method that recomputes the drag preview when the cursor position or geometry has changed. It queries `DropPreviewEngine.calculatePreview` using the cached card geometry, current cursor position and original elements, stores the latest `DragPreviewModel`, and forwards it to `DropIndicatorController` and the callback. It avoids redundant work by short-circuiting when the drag is idle or the new preview equals the previous one.",
    "refreshGeometryCache()": "Rebuilds the `GeometryCache` used by the preview engine. It walks the current card components supplied by the callback, skipping the card being dragged, collects their bounds relative to the flow panel, and maps each card back to an `SequenceElement` index using its ability key and occurrence count. The resulting `CardSnapshot` list and last visual index are wrapped into an immutable cache object for fast nearest-card queries."
  },
  "ui.presetManager.drag.handler.DragState": {
    "DragState(...)": "Constructor for this immutable data object. It captures a snapshot of the state at the beginning of a drag operation, including the `AbilityItem` being dragged, a reference to the source `JPanel`, whether it came from the palette, its original index in the sequence, and an immutable copy of the `SequenceElement` list at the moment the drag started. This ensures that all drag calculations are based on a consistent state, even if the UI is being re-rendered in real-time."
  },
  "ui.presetManager.drag.handler.DragOverlay": {
    "DragOverlay()": "Helper responsible for the floating drag card and trash affordance. When a drag starts it clones the original card into a standalone panel, attaches it to the root pane's glass pane with absolute positioning, and keeps it in sync with the cursor as it moves. It tracks whether the cursor has left the drop surface and swaps the card's icon to a pre-scaled trash image in that state, reverting on re-entry. `cleanup` removes the overlay and resets cached references.",
    "setDragOutsidePanel(boolean)": "Marks whether the current drag is considered outside the flow panel and updates the floating card's appearance accordingly. When set, it ensures the trash icon is loaded and replaces the original ability icon for the primary label; when cleared, it restores the original icon. This method is driven by the presenter, which determines panel hit-testing in detail coordinates."
  },
  "ui.presetManager.drag.handler.DropIndicatorController": {
    "DropIndicatorController(DropZoneIndicators)": "Constructor that wraps a `DropZoneIndicators` instance and initialises internal state used to track the last drawn indicator position and avoid duplicate logs. The controller centralises all indicator updates, letting `AbilityDragController` and the preview engine stay focused on geometry.",
    "updateIndicators(DragPreviewModel, boolean, Component[], DragState, Supplier<List<SequenceElement>>, Function<Component, Integer>, BiFunction<List<SequenceElement>, Integer, DropZoneType>, Function<DropZoneType, String>)": "Applies a `DragPreviewModel` to the visual indicators. It hides everything for invalid previews or drag-outside states, handles the empty-panel case, and otherwise computes left/right neighbour cards to draw the insertion line. For grouped drops it resolves the effective zone from either card metadata or the underlying `SequenceElement`s, derives top/bottom indicator symbols from the zone and model flags, and calls `showIndicators`. It also logs the first display and subsequent moves while deduplicating identical positions.",
    "cleanup()": "Resets internal tracking of the last indicator position and delegates to `DropZoneIndicators.cleanup` to remove any lines or symbols from the glass pane. This is called when a drag ends or is cancelled so the next drag starts clean."
  },
  "ui.presetManager.drag.logic.DropPreviewEngine": {
    "calculatePreview(Point, GeometryCache, List<SequenceElement>, List<SequenceElement>, boolean)": "Core engine that turns cursor position and card geometry into a `DragPreviewModel`. It picks the nearest card within a maximum distance, derives the tentative ability index from mapped occurrences, infers any existing group zone, and analyses group boundaries to decide whether the drop targets AND, OR, or NEXT semantics. It then computes the insert index, chooses a `PreviewSide` based on vertical position, and returns a model that encodes the `DropPreview`, button visibility, and cursor location. When release logging is enabled it emits detailed decisions to the logger.",
    "resolveGroupZoneAt(List<SequenceElement>, int)": "Utility that looks at the neighbours around a given ability index to infer whether it participates in an AND or OR group. It checks separators immediately before and after the ability and maps their type to a `DropZoneType`, returning null when no group is present.",
    "mapAbilityToPreviewIndex(List<SequenceElement>, String, int)": "Maps a visual card occurrence back to a list index. Given an ability key and a zero-based occurrence counter, it scans the sequence elements, counting only ability nodes with that key until it finds the requested occurrence and returns its index, or -1 if not found. This keeps preview geometry aligned even when abilities repeat.",
    "symbolForZone(DropZoneType)": "Translates a logical group zone into the symbol used by UI overlays. Returns '+' for AND, '/' for OR, and null for NEXT or unknown zones. `DropIndicatorController` uses this to render group buttons without duplicating mapping logic."
  }
}
