{
  "ui.presetManager.PresetManagerAction": {
    "execute()": "This method implements the `MenuAction` interface for the 'Preset Manager' menu item. When called, it ensures that only a single instance of the `PresetManagerWindow` is created and shown. If the window is already open, it brings it to the front. All UI operations are correctly dispatched to the Swing Event Dispatch Thread using `SwingUtilities.invokeLater`. It takes the `ConfigManager` as a dependency to pass to the window."
  },
  "ui.presetManager.masterRotations.SelectedSequenceIndicator": {
    "forSettings(AppSettings)": "A static factory method that creates an instance of `SelectedSequenceIndicator` bound to the application's `AppSettings`. It provides a `Supplier` that knows how to retrieve the currently selected rotation ID from the settings. This is the primary way this class is instantiated, decoupling the indicator from the specifics of the configuration structure.",
    "iconFor(String)": "This is the main public method used by the `SequenceListCellRenderer`. It takes a sequence ID and checks if it matches the currently selected ID (obtained via the `selectedIdSupplier`). If it matches, it returns the visual 'selected' icon; otherwise, it returns null. This allows the `JList` to display an indicator next to only the active rotation.",
    "createDefaultIcon()": "A private static method that programmatically creates the 'selected' icon, which is a green circle with a white checkmark. It uses `BufferedImage` and `Graphics2D` to draw the icon at runtime. This avoids the need to bundle a separate image file and allows for easy modification of the icon's appearance."
  },
  "ui.presetManager.masterRotations.SequenceListModel": {
    "loadFromConfig(RotationConfig)": "Populates the list model with data from the `RotationConfig`. It clears any existing data and then iterates through the `presets` map from the configuration, creating a `SequenceEntry` for each one. It correctly fires `fireIntervalRemoved` and `fireIntervalAdded` events to notify the listening `JList` that the data has changed, causing it to repaint.",
    "upsert(String, PresetData)": "Updates or inserts a sequence entry. It first searches for an existing entry with the given ID. If found, it updates the `PresetData` and fires a `fireContentsChanged` event to notify the `JList` of the change. If not found, it adds a new `SequenceEntry` to the end of the list and fires an `fireIntervalAdded` event. This is the primary method for updating the list when a preset is saved."
  },
  "ui.presetManager.masterRotations.SequenceMasterPanel": {
    "SequenceMasterPanel(...)": "Constructor for the 'master' view in the Preset Manager, which displays the list of all available sequences. It wires a `SequenceListModel` into a single-selection `JList`, configures a custom `SequenceListCellRenderer` that shows the selected-rotation indicator, and creates Add/Delete/Import/Export buttons. The panel also initializes listener collections that allow `PresetManagerWindow` to react to selection, add, delete, and import events without depending on concrete UI widgets.",
    "addSelectionListener(Consumer<SequenceEntry>)": "A public method that allows other components, specifically the `PresetManagerWindow`, to register a callback for when the user selects a different sequence in the `JList`. This is the core of the master-detail pattern, enabling the detail panel to be updated when the selection changes.",
    "importFromClipboard()": "The action handler for the 'Import' button. It reads text from the system clipboard using `getClipboardContent`, short-circuits when the clipboard is empty, and validates non-empty content with the injected `expressionValidator`. For valid expressions it forwards the string to all registered import listeners so the detail panel can open a new preset, and for invalid or unreadable content it uses the injected `ToastClient` to surface friendly error or info messages instead of throwing modal dialogs.",
    "SequenceListCellRenderer.getListCellRendererComponent(...)": "The core method of the private inner `JList` renderer. It's called for every item in the list to determine how it should be displayed. It sets the text of the label to the preset's name, paints the selected-rotation glyph from `SelectedSequenceIndicator` in a dedicated column, and mirrors the list's selection and focus colors. It also updates the row tooltip to indicate which entry is currently the active rotation stored in settings.",
    "setToastClient(ToastClient)": "Optional injection point for a `ToastClient`. The panel stores the reference and uses it to report clipboard import failures, empty selections, and export success or errors without blocking the user with modal dialogs. When no client is supplied it falls back to simple audible beeps for some operations, keeping the component functional in headless or test scenarios."
  },
  "ui.presetManager.PresetManagerWindow": {
    "PresetManagerWindow(ConfigManager)": "Constructor for the main `JFrame` of the Preset Manager. It creates the backing `SequenceListModel`, sets up the window shell, builds the master, detail, and palette panels, and wires them into nested `JSplitPane`s. During construction it creates a `ToastManager` to render non-blocking notifications and exposes its `ToastClient` to child panels, then calls `wireEventHandlers` and `loadSequences` before finally showing the window. Failures during initialization are logged and surfaced via toast errors.",
    "wireEventHandlers()": "A private method that connects the master, detail, and configuration layers. It registers listeners on the master panel for add, delete, and clipboard-import actions, supplies a robust expression validator for imports, and subscribes to selection changes. When the user switches presets it either auto-saves the current one (only when auto-save is enabled and there are unsaved changes) or explicitly discards edits. It also registers a save listener on the detail panel that updates the list model, recenters selection for newly created presets, and shows a success toast.",
    "handleDeleteSequence(SequenceEntry)": "The listener for the delete button. It validates that a preset is selected, prompts the user with a warning dialog, and on confirmation removes the preset from `RotationConfig` and persists the change via `configManager.saveRotations()`. Afterwards it reloads the list model, tries to keep or sensibly reassign the active selection, clears the detail panel when nothing remains, and reports both success and failure paths through structured logging and toast messages.",
    "updateActiveRotation(String)": "This method is called whenever the user selects a sequence in the master list. It lazily initializes the `RotationSettings` section of `AppSettings` if needed, compares the new ID with the current one, and only writes to disk when the active selection actually changes. On change it updates `selectedId`, calls `configManager.saveSettings()` with error handling that logs and toasts failures, and finally asks the master panel to refresh its list so the selected-rotation indicator stays in sync."
  }
}
