{
  "ui.presetManager.palette.CategorySearchState": {
    "CategorySearchState(String, List<SearchResult>)": "Constructor for this immutable data object. It stores the results of a search operation for a single ability category. It takes the category name and the list of `SearchResult`s. A key behavior is that it pre-calculates and caches the `matchCount`, which is used to update the tab titles with the number of matching abilities. This is instantiated by `AbilityPalettePanel` during a search.",
    "getFormattedTabTitle()": "A simple getter that returns a string for the category's tab in the UI. If there are any matching results (`matchCount > 0`), it formats the title to include the count (e.g., '3 - Melee'). Otherwise, it just returns the category name. This provides immediate visual feedback to the user about which categories contain search results."
  },
  "ui.presetManager.palette.AbilityPalettePanel": {
    "AbilityPalettePanel(...)": "Constructor for the panel that displays the grid of all available abilities. It takes the `AbilityConfig` and `AbilityCategoryConfig` to source the abilities and their groupings. Its main responsibility is to call `loadCategories` to build the tabbed UI. It also creates the search field and attaches a listener to it. This panel is a core component of the `PresetManagerWindow`.",
    "performSearch()": "The main search logic, triggered by the search field's `DocumentListener`. It gets the query, then for each category, it iterates through all abilities and calls `FuzzySearchService.calculateMatchScore`. It aggregates these results into `CategorySearchState` objects and then calls `updateTabTitles` and `updateAbilityCards` to refresh the UI, providing real-time visual feedback by dimming non-matching abilities and updating tab titles with match counts.",
    "loadCategories()": "This method is called once by the constructor to build the entire palette UI. It reads the categories from `AbilityCategoryConfig`, creates a `JTabbedPane`, and for each category, it creates a `CategoryPanel` populated with `AbilityCard`s. A key feature is its handling of uncategorized abilities, which it automatically groups into a fallback 'Items' category, ensuring all abilities are visible in the UI.",
    "AbilityCard.AbilityCard(AbilityItem)": "Constructor for the private inner class that represents a single draggable ability in the palette. It creates a `JPanel` with an icon and a name label. Crucially, it attaches a `MouseListener` that, on a left-click press, calls `detailPanel.startPaletteDrag()`. This is the entry point that initiates a drag-and-drop operation, transferring control to the `AbilityDragController`."
  },
  "ui.presetManager.palette.FuzzySearchService": {
    "calculateMatchScore(String, String)": "The main public method of the fuzzy search logic. It takes a query and a target string. It first checks for exact and prefix matches, assigning them high scores. If neither match, it falls back to the `fuzzyMatch` method for character-by-character analysis. This tiered approach ensures that stronger matches are ranked higher. A score of -1 indicates no match. This is called by `AbilityPalettePanel` for every ability on every keystroke in the search field.",
    "fuzzyMatch(String, String)": "A private method that implements a simple fuzzy matching algorithm. It iterates through the target string, checking if characters from the query appear in the correct order. It calculates a score based on the percentage of matched characters, with bonuses for consecutive matches and for matches that occur earlier in the string. This provides a good balance of performance and accuracy for finding abilities."
  },
  "ui.presetManager.palette.SearchResult": {
    "SearchResult(AbilityItem, int)": "Constructor for this immutable data object. It pairs an `AbilityItem` with the integer `matchScore` calculated by the `FuzzySearchService`. It also pre-calculates and caches the `matches` boolean flag (true if score >= 0). This object is used by the `AbilityPalettePanel` to store the outcome of a search for a single ability, and the `matches` flag is used to determine whether to dim the ability's card in the UI."
  }
}