{
  "ui.presetManager.service.SequenceVisualService": {
    "parseToVisualElements(String)": "The main entry point that converts a raw sequence expression into a list of `SequenceElement` objects for the UI. It now uses `TooltipMarkupParser` to handle tooltip annotations, inserting them as `TooltipElement`s into the list alongside abilities and operators.",
    "convertDefinitionToElements(SequenceDefinition)": "Traverses the AST to build the list of visual elements. It uses `TooltipStructure.linearize` to ensure the traversal order matches the structure expected by the tooltip parser.",
    "extractAbilityKeys(String)": "Extracts just the ability keys from a sequence expression. This is useful when you only need the ability names without separators."
  },
  "ui.presetManager.service.ExpressionBuilder": {
    "buildExpression(List<SequenceElement>)": "Reconstructs the raw expression string from UI elements. It now handles `TooltipElement`s by wrapping their text in parentheses and escaping special characters.",
    "removeAbilityAt(List<SequenceElement>, int)": "A key business logic method for editing a sequence. It removes an ability element at a given index from the list. Critically, after removing the ability, it calls `cleanupAfterRemoval` to normalize the surrounding separators. For example, removing 'B' from 'A + B + C' results in 'A + C', not 'A + + C'. This ensures the resulting sequence remains syntactically valid.",
    "insertAbility(List<SequenceElement>, String, int, DropZoneType, DropSide)": "This is the most complex method, handling the logic for adding a new ability to the sequence based on a drag-and-drop operation. It uses the `DropZoneType` (AND, OR, NEXT) and `DropSide` (LEFT, RIGHT) to determine where and how to insert the new ability and its corresponding separators. It correctly handles inserting into existing groups, creating new groups, or splitting existing groups, ensuring the resulting sequence is always well-formed.",
    "insertSequence(List<SequenceElement>, List<SequenceElement>, int, DropZoneType, DropSide)": "Inserts an entire sequence of elements (e.g., from a clipboard paste) into the current sequence at the specified location. It handles complex insertion logic, including splitting existing groups if inserting with `NEXT` zone type, and normalizing separators to ensure the resulting sequence is valid. It allows for bulk insertion of multi-step rotations.",
    "analyzeGroup(List<SequenceElement>, int)": "A private helper method used by the insertion and removal logic. Given a list of elements and the index of an ability, it scans backwards and forwards from that index to identify if the ability is part of a contiguous group (connected by '+' or '/'). It returns a `GroupInfo` object containing the group's type and its start and end indices. This is essential for making intelligent decisions about how to modify groups during editing.",
    "insertTooltip(List<SequenceElement>, String, int, DropZoneType, DropSide)": "Inserts a new tooltip element into the sequence at the specified index. It validates the message content and places it in the list without altering the surrounding logical structure.",
    "removeTooltipAt(List<SequenceElement>, int)": "Removes a tooltip element at the specified index. Unlike ability removal, this does not require complex separator normalization as tooltips are just annotations.",
    "editTooltipAt(List<SequenceElement>, int, String)": "Updates the message of an existing tooltip element. It validates the new message and handles cases where the message becomes empty (treating it as a removal)."
  }
}
