{
  "ui.presetManager.PresetManagerAction": {
    "execute()": "This method implements the `MenuAction` interface for the 'Preset Manager' menu item. When called, it ensures that only a single instance of the `PresetManagerWindow` is created and shown. If the window is already open, it brings it to the front. All UI operations are correctly dispatched to the Swing Event Dispatch Thread using `SwingUtilities.invokeLater`. It takes the `ConfigManager` as a dependency to pass to the window."
  },
  "ui.presetManager.masterRotations.SelectedSequenceIndicator": {
    "forSettings(AppSettings)": "A static factory method that creates an instance of `SelectedSequenceIndicator` bound to the application's `AppSettings`. It provides a `Supplier` that knows how to retrieve the currently selected rotation ID from the settings. This is the primary way this class is instantiated, decoupling the indicator from the specifics of the configuration structure.",
    "iconFor(String)": "This is the main public method used by the `SequenceListCellRenderer`. It takes a sequence ID and checks if it matches the currently selected ID (obtained via the `selectedIdSupplier`). If it matches, it returns the visual 'selected' icon; otherwise, it returns null. This allows the `JList` to display an indicator next to only the active rotation.",
    "createDefaultIcon()": "A private static method that programmatically creates the 'selected' icon, which is a green circle with a white checkmark. It uses `BufferedImage` and `Graphics2D` to draw the icon at runtime. This avoids the need to bundle a separate image file and allows for easy modification of the icon's appearance."
  },
  "ui.presetManager.masterRotations.SequenceListModel": {
    "loadFromConfig(RotationConfig)": "Populates the list model with data from the `RotationConfig`. It clears any existing data and then iterates through the `presets` map from the configuration, creating a `SequenceEntry` for each one. It correctly fires `fireIntervalRemoved` and `fireIntervalAdded` events to notify the listening `JList` that the data has changed, causing it to repaint.",
    "upsert(String, PresetData)": "Updates or inserts a sequence entry. It first searches for an existing entry with the given ID. If found, it updates the `PresetData` and fires a `fireContentsChanged` event to notify the `JList` of the change. If not found, it adds a new `SequenceEntry` to the end of the list and fires an `fireIntervalAdded` event. This is the primary method for updating the list when a preset is saved."
  },
  "ui.presetManager.masterRotations.SequenceMasterPanel": {
    "SequenceMasterPanel(...)": "Constructor for the 'master' view in the Preset Manager, which displays the list of all available sequences. It creates the `JList` and its `SequenceListModel`, and sets a custom `SequenceListCellRenderer` to handle the display of the 'selected' indicator. It also creates the control buttons (Add, Delete, etc.) and lays out the panel. It's instantiated by `PresetManagerWindow`.",
    "addSelectionListener(Consumer<SequenceEntry>)": "A public method that allows other components, specifically the `PresetManagerWindow`, to register a callback for when the user selects a different sequence in the `JList`. This is the core of the master-detail pattern, enabling the detail panel to be updated when the selection changes.",
    "importFromClipboard()": "The action listener for the 'Import' button. It reads the content of the system clipboard, validates it using the `expressionValidator`, and if it's a valid sequence expression, it notifies the registered import listeners. It provides user feedback on success or failure using the `ToastManager`.",
    "SequenceListCellRenderer.getListCellRendererComponent(...)": "The core method of the private inner `JList` renderer. It's called for every item in the list to determine how it should be displayed. It sets the text of the label to the preset's name and, crucially, calls `selectedIndicator.iconFor()` to get the 'selected' icon if the item is the active rotation. It also handles the visual appearance for selected and focused states."
  },
  "ui.presetManager.PresetManagerWindow": {
    "PresetManagerWindow(ConfigManager)": "Constructor for the main `JFrame` of the Preset Manager. It orchestrates the creation of all the major UI panels (`SequenceMasterPanel`, `SequenceDetailPanel`, `AbilityPalettePanel`) and arranges them within nested `JSplitPane`s. It also calls `wireEventHandlers` to connect the different components, establishing the master-detail communication and handling add/delete/save events. This is the central hub of the preset management feature.",
    "wireEventHandlers()": "A private method that sets up all the event listeners that connect the different panels. It registers listeners on the `masterPanel` to handle selection changes (which updates the `detailPanel`), add/delete requests, and imports. Before switching selections it now conditionally auto-saves the currently edited preset when `AppSettings.rotation.autoSaveOnSwitch` is true, preventing silent loss of work. It also registers a save listener on the `detailPanel` to update the `sequenceListModel` when a change is committed. This method is crucial for making the different parts of the UI work together.",
    "handleDeleteSequence(SequenceEntry)": "The listener for the delete button. It shows a confirmation dialog to the user. If confirmed, it removes the preset from the `RotationConfig`, calls `configManager.saveRotations()` to persist the change, and then reloads the `sequenceListModel`. It includes logic to intelligently re-select a new item after the deletion to ensure a smooth user experience.",
    "updateActiveRotation(String)": "This method is called whenever the user selects a sequence in the master list. Its purpose is to persist this selection as the 'active' rotation for the main application. It updates the `RotationSettings` in the `AppSettings` object and calls `configManager.saveSettings()`. This ensures that the next time the application starts, it will load the sequence that the user last selected in the Preset Manager."
  }
}
