{
  "ui.settings.IconSizeSettingsPanel": {
    "IconSizeSettingsPanel(ConfigManager)": "Constructor for the 'General' settings tab. It builds a small form that lets the user choose an ability icon size and toggle whether presets are auto-saved when switching. It queries `ScalingConverter.getAllSizes()` to populate a `JSpinner`, reads the current icon size and rotation settings from `AppSettings`, and pre-fills the spinner and auto-save checkbox. The panel is hosted inside the `SettingsAction` window.",
    "handleSave()": "This private method backs the General tab's Save button. It reads the requested icon size from the spinner, snaps it to the nearest supported value via `resolveNearestSize`, and writes that value into `AppSettings.UiSettings`. It also ensures a `RotationSettings` object exists and updates its `autoSaveOnSwitch` flag from the checkbox. The updated settings are persisted with `configManager.saveSettings()`, and the status label is updated with a green success message or a red failure message that includes the exception text.",
    "resolveNearestSize(int)": "A private utility method that takes a user-requested icon size and finds the closest valid size from the list of pre-processed, supported sizes. This ensures that the user's selection always maps to a set of icons that actually exist on disk, preventing errors in the detection engine. It iterates through the `supportedSizes` array and returns the one with the minimum absolute difference from the requested size."
  },
  "ui.settings.HotkeySettingsPanel": {
    "HotkeySettingsPanel(ConfigManager)": "Constructor for the 'Hotkeys' tab in the settings window. It builds a complex `JPanel` that displays a table of all available hotkey actions. For each action, it shows the default binding and provides a text field and checkbox for the user to set and enable a custom binding. It dynamically creates a `Row` for each binding found in the `HotkeySettings`. This is instantiated by `SettingsAction`.",
    "handleSave()": "The `ActionListener` for the 'Save hotkeys' button. It iterates through each `Row` in the UI, retrieves the custom binding string from the text field, and calls `parseCustomBindings` to validate and parse it into the required format for `settings.json`. If all custom bindings are valid, it updates the `HotkeySettings` object and calls `configManager.saveSettings()`. If any binding is invalid, it highlights the field and displays an error message.",
    "parseCustomBindings(String, String)": "A private validation and parsing method. It takes the raw string from a custom hotkey text field (e.g., 'CTRL + SHIFT + F1, ALT + F2') and splits it into individual key sequences. For each sequence, it performs a series of validation checks: it must contain exactly one non-modifier key and at least one modifier. If valid, it converts the sequence into a `List<List<String>>` format that matches the schema of `settings.json`. If invalid, it returns a descriptive error message.",
    "KeyCapturePopup.dispatchKeyEvent(KeyEvent)": "The core method of the private inner `KeyCapturePopup` class. It's a `KeyEventDispatcher`, meaning it intercepts all key events while the popup is visible. It ignores key releases and modifiers pressed alone. When a valid combination (modifiers + a final key) is pressed, it calls `translateEvent` to convert the `KeyEvent` into a list of string tokens, passes this list to the completion callback, and closes itself. It also handles the ESC key to cancel the capture."
  }
}
